<center>
<img src="../../img/ods_stickers.jpg" />
    
## [mlcourse.ai](https://mlcourse.ai) – Open Machine Learning Course 
Author: Arina Lopukhova (@erynn). Edited by [Yury Kashnitskiy](https://yorko.github.io) (@yorko) and Vadim Shestopalov (@vchulski). This material is subject to the terms and conditions of the [Creative Commons CC BY-NC-SA 4.0](https://creativecommons.org/licenses/by-nc-sa/4.0/) license. Free use is permitted for any non-commercial purpose.

# <center>Assignment #1. Fall 2019
## <center>Exploratory data analysis of Olympic games with Pandas
    
<img src='../../img/olympic_logo.png' width=50%>

Prior to working on the assignment, you'd better check out the corresponding course material:
 - [Exploratory data analysis with Pandas](https://nbviewer.jupyter.org/github/Yorko/mlcourse_open/blob/master/jupyter_english/topic01_pandas_data_analysis/topic1_pandas_data_analysis.ipynb?flush_cache=true), the same as an interactive web-based [Kaggle Kernel](https://www.kaggle.com/kashnitsky/topic-1-exploratory-data-analysis-with-pandas)
 - first lectures in mlcourse.ai [YouTube playlist ](https://www.youtube.com/watch?v=QKTuw4PNOsU&list=PLVlY_7IJCMJeRfZ68eVfEcu-UcN9BbwiX) 
 - you can also practice with demo assignments, which are simpler and already shared with solutions: [A1 demo](https://www.kaggle.com/kashnitsky/a1-demo-pandas-and-uci-adult-dataset), [solution](https://www.kaggle.com/kashnitsky/a1-demo-pandas-and-uci-adult-dataset-solution)

### Your task is to:
 1. write code and perform computations in the cells below
 2. choose answers in the [webform](https://docs.google.com/forms/d/1JxhQ9Bg4OpM3E5N47ZuRbILgDuMRbvEnUbDMZK8L-NU). Solutions will be shared only with those who've filled in this form 
 3. submit answers with some email and **remember it**! This will be your ID during the course. Specify your real full name in the form as well (no nicks allowed in the final top-100 [rating](https://mlcourse.ai/rating)). If in doubt, you can re-submit the form till the deadline for A1, no problem, but stick to only one email.
 
### <center> Deadline for A1: 2019 September 15, 20:59 GMT (London time)
    
You'll get up to 10 credits for this assignment.

### How to get help
In [ODS Slack](https://opendatascience.slack.com) (if you still don't have access, fill in the [form](https://docs.google.com/forms/d/10HAN5huM996snUKjsNYyT_oOlm2uOsTKulKurb3oiNM/) mentioned on the mlcourse.ai main page), we have a channel **#mlcourse_ai_news** with announcements from the course team.
You can discuss the course content freely in the **#mlcourse_ai** channel (we still have a huge Russian-speaking group, they have a separate channel **#mlcourse_ai_rus**).

Here's how you reply in a thread (press this dialog icon to drill down into a thread):

<img src="../../img/start_a_thread.png" />

Please stick to special threads *a1_q1-5_fall2019* and *a1_q6-10_fall2019* in **#mlcourse_ai_news** for your questions on A1. Help each other without sharing correct code and answers. Our TA **Vadim @vchulski** is there to help (only in the mentioned thread, do not write to him directly).

Lastly, you can save useful messages by pinning them, further you can find pinned items on the top, just below the channel name:

<img src="../../img/pinned_item.png" />

### Assignment 
__There are ten questions about 120 years of Olympic history in this task. Your task is to fill in the missing Python code and choose answers in [this web-form](https://docs.google.com/forms/d/1JxhQ9Bg4OpM3E5N47ZuRbILgDuMRbvEnUbDMZK8L-NU).__

Download the file `athlete_events.csv` from [here](https://drive.google.com/file/d/1f5v6Z2ayc7h698FG_98wP5x1Y2zZQeox/view?usp=sharing) (scraped by [rgriffin](https://www.randigriffin.com/) from www.sports-reference.com). The dataset has the following features:

- __ID__ - Unique number for each athlete
- __Name__ - Athlete's name
- __Sex__ - M or F
- __Age__ - Integer
- __Height__ - In centimeters
- __Weight__ - In kilograms
- __Team__ - Team name
- __NOC__ - National Olympic Committee 3-letter code
- __Games__ - Year and season
- __Year__ - Integer
- __Season__ - Summer or Winter
- __City__ - Host city
- __Sport__ - Sport
- __Event__ - Event
- __Medal__ - Gold, Silver, Bronze, or NA

In [2]:
import pandas as pd

In [3]:
# Change the path to the dataset file if needed. 
PATH = '../../data/athlete_events.csv'

In [4]:
data = pd.read_csv(PATH)
data.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

__1. How old were the youngest male and female participants of the 1992 Olympics?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q1-5_fall2019*

- 16 and 15
- 14 and 13 
- 13 and 11
- 11 and 12

In [5]:
data.describe()

,ID,Age,Height,Weight,Year
count,271116.000000,261642.000000,210945.000000,208241.000000,271116.000000
mean,68248.954396,25.556898,175.338970,70.702393,1978.378480
std,39022.286345,6.393561,10.518462,14.348020,29.877632
min,1.000000,10.000000,127.000000,25.000000,1896.000000
25%,34643.000000,21.000000,168.000000,60.000000,1960.000000
50%,68205.000000,24.000000,175.000000,70.000000,1988.000000
75%,102097.250000,28.000000,183.000000,79.000000,2002.000000
max,135571.000000,97.000000,226.000000,214.000000,2016.000000

In [6]:
data.shape

(271116, 15)

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271116 entries, 0 to 271115
Data columns (total 15 columns):
ID        271116 non-null int64
Name      271116 non-null object
Sex       271116 non-null object
Age       261642 non-null float64
Height    210945 non-null float64
Weight    208241 non-null float64
Team      271116 non-null object
NOC       271116 non-null object
Games     271116 non-null object
Year      271116 non-null int64
Season    271116 non-null object
City      271116 non-null object
Sport     271116 non-null object
Event     271116 non-null object
Medal     39783 non-null object
dtypes: float64(3), int64(2), object(10)
memory usage: 31.0+ MB

In [8]:
group = data["Sex"]
group.value_counts()

M    196594
F     74522
Name: Sex, dtype: int64

In [9]:
test = data.groupby(["Sex"])
test.describe()

           ID                                                                 \
        count          mean           std  min       25%      50%        75%
Sex
F     74522.0  69956.722887  38932.561177  5.0  36558.50  70128.0  103534.75
M    196594.0  67601.598304  39036.820069  1.0  33868.25  67271.5  101638.00

                    Age             ... Weight             Year               \
          max     count       mean  ...    75%    max     count         mean
Sex                                 ...
F    135568.0   74098.0  23.732881  ...   65.0  167.0   74522.0  1992.445748
M    135571.0  187544.0  26.277562  ...   83.0  214.0  196594.0  1973.046064


           std     min     25%     50%     75%     max
Sex
F    20.458993  1900.0  1984.0  1998.0  2008.0  2016.0
M    31.127867  1896.0  1952.0  1980.0  2000.0  2016.0

[2 rows x 40 columns]

In [10]:
data.describe(include = "all"),percentiles

NameError: name 'percentiles' is not defined

In [11]:
data[data['Year'] == 1992].groupby(by=['Year','Season'],as_index = False)['ID'].count()

   Year  Season     ID
0  1992  Summer  12977
1  1992  Winter   3436

In [12]:
data[data.Year == 1992].groupby(by=['Sex'],as_index = False)['Age'].min()

  Sex   Age
0   F  12.0
1   M  11.0

__2. What was the percentage of male basketball players among all the male participants of the 2012 Olympics? Round the answer to the first decimal.__

*Hint:* here and further if needed drop duplicated sportsmen to count only unique ones. 

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q1-5_fall2019*

- 0.2
- 1.5 
- 2.5
- 7.7

In [13]:
import numpy as np
columns_person = ['ID','Name','Sex','Age','Height','Weight','NOC',"Sport"]
data_new = data.loc[np.logical_and(data.Year == 2012, data.Sex == 'M'),columns_person].drop_duplicates()
data_new

,ID,Name,Sex,Age,Height,Weight,NOC,Sport
1,2,A Lamusi,M,23.0,170.0,60.0,CHN,Judo
98,34,Jamale (Djamel-) Aarrass (Ahrass-),M,30.0,187.0,76.0,FRA,Athletics
134,48,Abdelhak Aatakni,M,24.0,NaN,64.0,MAR,Boxing
174,73,Luc Abalo,M,27.0,182.0,86.0,FRA,Handball
197,91,Emanuele Abate,M,27.0,190.0,80.0,ITA,Athletics
...,...,...,...,...,...,...,...,...
271004,135516,Krzysztof Maciej Zwarycz,M,21.0,170.0,77.0,POL,Weightlifting
271020,135526,Dniel Zwickl,M,27.0,178.0,71.0,HUN,Table Tennis
271023,135528,Marc Zwiebler,M,28.0,181.0,75.0,GER,Badminton
271090,135557,Dominik ycki,M,38.0,192.0,95.0,POL,Sailing
271091,135558,ukasz Tomasz ygado,M,32.0,200.0,89.0,POL,Volleyball

In [14]:
sports = data.Sport.unique()
sports

array(['Basketball', 'Judo', 'Football', 'Tug-Of-War', 'Speed Skating',
       'Cross Country Skiing', 'Athletics', 'Ice Hockey', 'Swimming',
       'Badminton', 'Sailing', 'Biathlon', 'Gymnastics',
       'Art Competitions', 'Alpine Skiing', 'Handball', 'Weightlifting',
       'Wrestling', 'Luge', 'Water Polo', 'Hockey', 'Rowing', 'Bobsleigh',
       'Fencing', 'Equestrianism', 'Shooting', 'Boxing', 'Taekwondo',
       'Cycling', 'Diving', 'Canoeing', 'Tennis', 'Modern Pentathlon',
       'Figure Skating', 'Golf', 'Softball', 'Archery', 'Volleyball',
       'Synchronized Swimming', 'Table Tennis', 'Nordic Combined',
       'Baseball', 'Rhythmic Gymnastics', 'Freestyle Skiing',
       'Rugby Sevens', 'Trampolining', 'Beach Volleyball', 'Triathlon',
       'Ski Jumping', 'Curling', 'Snowboarding', 'Rugby',
       'Short Track Speed Skating', 'Skeleton', 'Lacrosse', 'Polo',
       'Cricket', 'Racquets', 'Motorboating', 'Military Ski Patrol',
       'Croquet', 'Jeu De Paume', 'Roque', 'Alpinism', 'Basque Pelota',
       'Aeronautics'], dtype=object)

In [15]:
sports_basketball_2 = [sport for sport in  sports if ('Basketball')]
sports_basketball_2

['Basketball',
 'Judo',
 'Football',
 'Tug-Of-War',
 'Speed Skating',
 'Cross Country Skiing',
 'Athletics',
 'Ice Hockey',
 'Swimming',
 'Badminton',
 'Sailing',
 'Biathlon',
 'Gymnastics',
 'Art Competitions',
 'Alpine Skiing',
 'Handball',
 'Weightlifting',
 'Wrestling',
 'Luge',
 'Water Polo',
 'Hockey',
 'Rowing',
 'Bobsleigh',
 'Fencing',
 'Equestrianism',
 'Shooting',
 'Boxing',
 'Taekwondo',
 'Cycling',
 'Diving',
 'Canoeing',
 'Tennis',
 'Modern Pentathlon',
 'Figure Skating',
 'Golf',
 'Softball',
 'Archery',
 'Volleyball',
 'Synchronized Swimming',
 'Table Tennis',
 'Nordic Combined',
 'Baseball',
 'Rhythmic Gymnastics',
 'Freestyle Skiing',
 'Rugby Sevens',
 'Trampolining',
 'Beach Volleyball',
 'Triathlon',
 'Ski Jumping',
 'Curling',
 'Snowboarding',
 'Rugby',
 'Short Track Speed Skating',
 'Skeleton',
 'Lacrosse',
 'Polo',
 'Cricket',
 'Racquets',
 'Motorboating',
 'Military Ski Patrol',
 'Croquet',
 'Jeu De Paume',
 'Roque',
 'Alpinism',
 'Basque Pelota',
 'Aeronautics']

In [16]:
sports_basketball = [sport for sport in  sports if ('Basketball'in sport)]
sports_basketball

['Basketball']

In [17]:
#data_new.shape
data_new.ID.count()

5863

In [18]:
data_new['new_Basketball'] = data_new["Sport"].isin(sports_basketball).astype(int)
(data_new.new_Basketball.value_counts(normalize = True)*100).round(1)

0    97.5
1     2.5
Name: new_Basketball, dtype: float64

__3. What are the mean and standard deviation of height for female tennis players who participated in the 2000 Olympics? Round the answer to the first decimal.__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q1-5_fall2019*

- 171.8 and 6.5
- 179.4 and 10
- 180.7 and 6.7
- 182.4 and 9.1

In [19]:
import numpy as np
columns_person = ['ID','Name','Sex','Age','Height','Weight','NOC',"Sport"]
data_new_2 = data.loc[(data.Year == 2000)&(data.Sex == 'F')&(data.Sport == 'Basketball'), columns_person].drop_duplicates()
data_new_2.head()

,ID,Name,Sex,Age,Height,Weight,NOC,Sport
1034,580,Svetlana Olegovna Abrosimova,F,20.0,188.0,77.0,RUS,Basketball
1857,1020,Adriana Aparecida dos Santos,F,29.0,180.0,61.0,BRA,Basketball
1863,1023,"Adriana ""Adrianinha"" Moiss Pinto",F,21.0,170.0,65.0,BRA,Basketball
4458,2546,Alessandra dos Santos de Oliveira,F,26.0,200.0,85.0,BRA,Basketball
8185,4516,Nicole Antibe,F,26.0,187.0,83.0,FRA,Basketball

In [20]:
sport_tennis = [sport for sport in sports if ('Tennis' in sport)]
sport_tennis

['Tennis', 'Table Tennis']

In [21]:
data_new_2.ID.count()

142

In [22]:
data_new_2.describe().round()

             ID    Age  Height  Weight
count     142.0  142.0   142.0   142.0
mean    65981.0   27.0   182.0    73.0
std     38666.0    4.0     9.0     9.0
min       580.0   17.0   162.0    58.0
25%     33914.0   24.0   175.0    67.0
50%     64472.0   27.0   182.0    73.0
75%     96557.0   30.0   190.0    80.0
max    135105.0   37.0   213.0   100.0

__4. Find a sportsman who participated in the 2006 Olympics, with the highest weight among other participants of the same Olympics. What sport did he or she do?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q1-5_fall2019*

- Judo
- Bobsleigh 
- Skeleton
- Boxing

In [23]:
data[data.Year == 2006].groupby(by=['Year','Season'],as_index= False)['ID'].count()

   Year  Season    ID
0  2006  Winter  4382

In [24]:
maxwt = data[data.Year == 2006]['Weight'].max()
maxwt

127.0

In [25]:
data.loc[(data.Year == 2006) & (data.Weight == maxwt),: ]

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
8102,4476,Patrick R. Antaki,M,41.0,185.0,127.0,Lebanon,LIB,2006 Winter,2006,Winter,Torino,Skeleton,Skeleton Men's Skeleton,NaN

__5. How many times did John Aalberg participate in the Olympics held in different years?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q1-5_fall2019*

- 0
- 1 
- 2
- 3

In [27]:
# You code here
data.loc[data.Name == 'John Aalberg' ].Year

18    1992
19    1992
20    1992
21    1992
22    1994
23    1994
24    1994
25    1994
Name: Year, dtype: int64

__6. How many gold medals in tennis did sportspeople from the Switzerland team win at the 2008 Olympics? Count every medal from every sportsperson.__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q6-10_fall2019*

- 0
- 1 
- 2
- 3

In [28]:
data[data.Year == 2008].groupby(by=['Year','Season'],as_index=False)['ID'].count()

   Year  Season     ID
0  2008  Summer  13602

In [29]:
data[(data.Year == 2008)&(data.Sport == 'Tennis')&(data['Team'].isin(['Switzerland']))].groupby(by=['Team','Medal'], as_index = False)['ID'].count()

          Team Medal  ID
0  Switzerland  Gold   2

__7. Is it true that Spain won fewer medals than Italy at the 2016 Olympics? Do not consider NaN values in _Medal_ column.__ 

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q6-10_fall2019*

- Yes
- No

In [30]:
def medal(cnt):
    print(cnt,':',data[(data.Year==2016)&(data.Team==cnt)&(data.Medal.notnull())]['Medal'].count(),"medals")

In [31]:
medal('Spain')
medal('Italy')

Spain : 43 medals
Italy : 70 medals

__8. What age category did the fewest and the most participants of the 2008 Olympics belong to?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q6-10_fall2019*

- [45-55] and [25-35) correspondingly
- [45-55] and [15-25) correspondingly
- [35-45) and [25-35) correspondingly
- [45-55] and [35-45) correspondingly

In [32]:
data[(data.Year == 2008)]['Age'].describe()

count    13600.000000
mean        25.734118
std          5.685902
min         12.000000
25%         22.000000
50%         25.000000
75%         29.000000
max         67.000000
Name: Age, dtype: float64

In [33]:
pd.cut(data.loc[(data.Year==2008),['ID','Age']]['Age'],bins = 4,duplicates='drop',right=False).value_counts()

[12.0, 25.75)      7369
[25.75, 39.5)      5915
[39.5, 53.25)       298
[53.25, 67.055)      18
Name: Age, dtype: int64

In [34]:
pd.cut(data.loc[(data.Year==2008),['ID','Age']].drop_duplicates()['Age'],bins = 4,duplicates='drop',right=False).value_counts()

[12.0, 25.75)      5677
[25.75, 39.5)      5001
[39.5, 53.25)       208
[53.25, 67.055)      12
Name: Age, dtype: int64

__9. Is it true that there were Summer Olympics held in Atlanta? Is it true that there were Winter Olympics held in Squaw Valley?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q6-10_fall2019*

- Yes, Yes
- Yes, No
- No, Yes 
- No, No

In [35]:
def Olympics(city): 
    return(data.loc[(data.City==city),['City','Year','Season']].drop_duplicates())

In [36]:
#Olympics('Atlanta')
Olympics('Squaw')

Empty DataFrame
Columns: [City, Year, Season]
Index: []

__10. What is the absolute difference between the number of unique sports at the 1986 Olympics and 2002 Olympics?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q6-10_fall2019*

- 3 
- 10
- 15
- 27

In [37]:
data[data.Year == 1986].groupby(by=['Year','Season'],as_index=True)['Sport'].nunique()

Series([], Name: Sport, dtype: int64)

In [43]:
(data[data.Year == 2002]).groupby(by=['Year','Season'],as_index=False)['Sport'].nunique()

0    15
Name: Sport, dtype: int64

In [44]:
(data[data.Year == 1986]).groupby(by=['Year','Season'],as_index=False)['Sport'].nunique()

Series([], Name: Sport, dtype: int64)